function f=a2016_fun1(x,v,g,rho1,G,s,H,x0)
%x(1)为未知量h[超出水面的部分]
%x(2)为T1[第一根钢管对浮标的作用力]
%x(3)为theta1[T1与垂直面的夹角]
% x(1)=x_fix;
f=zeros(26,1);
f(1)=0.625.*(v.^2)*2*x0-x(2)*sin(x(3));%风力大小
f(2)=rho1*g*pi*(2-x(1))-G(1)-x(2)*cos(x(3));
for i=3:6
    f(i)=x(2*i-4)*sin(x(2*i-3))-x(2*i-2)*sin(x(2*i-1));
    f(i+4)=x(2*i-2)*cos(x(2*i-1))-x(2*i-4)*cos(x(2*i-3))-G(i-1);
    %%x(4),x(5)为T2，theta2，接下来呢成对出现至x(11)
    f(i+8)=x(2*i-4)*0.5*sin(x(i+9)-x(2*i-3))-x(2*i-2)*0.5*sin(x(2*i-1)-x(i+9));
    %%x(12)-x(15)为钢管与竖直方向的夹角
    f(i+12)=x(i+13)-cos(x(i+9));
    %%x(16)-x(19)为钢管在竖直方向的投影长度
end
%%以上有16+3(include h)个未知量，且已有18个式子，包含浮标和钢管的受力分析

%%钢桶和重物球的受力分析
f(19)=x(9)*sin(x(10))-x(20)*sin(x(21));%x(20),x(21)为下方锚链对其的拉力T锚和与竖直平面的夹角
f(20)=x(9)*cos(x(10))-G(6)-x(20)*cos(x(21));
f(21)=x(9)*0.5*sin(x(22)-x(10))-x(20)*0.5*sin(x(21)-x(22));
%x(22)为钢桶与竖直平面的倾斜角度
f(22)=x(23)-cos(x(22));%x(23)为钢桶在竖直方向的投影长度H桶
f(23)=x(20)*sin(x(21))-x(24)*sin(x(25));%x(24),x(25)为锚链对锚的拉力T0和锚链与竖直方向夹角theta0
f(24)=x(20)*cos(x(21))-G(7)-x(24)*cos(x(25));%锚链竖直方向受力平衡
f(25)=x(26)-(s/G(7))*(sqrt((G(7)+x(24)*cos(x(25)))^2+(x(24)*sin(x(25)))^2)-sqrt((x(24)*sin(x(25)))^2+(x(24)*cos(x(25)))^2));
%对锚链的曲线积分%x(26)为得出的y
f(26)=H-(2-x(1))-x(26)-x(23)-x(16)-x(17)-x(18)-x(19);
%%H为海平面与海底的总高度%%
f=f(:);
end

